#### Handling Null values

In [5]:
import pandas as pd
import numpy as np
data=pd.read_excel('company.xlsx')

In [2]:
data

    EEID   Name  Gender    Salary
0  EMP01  Arhaan       M      NaN
1  EMP02   Dayam       M  25000.0
2  EMP01    Anam     NaN  27000.0
3  EMP04  Arhaan       M  20000.0
4  EMP05     NaN       F  25000.0
5  EMP06    Asif       M      NaN

In [3]:
data.isnull()

    EEID  Name   Gender   Salary
0  False  False    False    True
1  False  False    False   False
2  False  False     True   False
3  False  False    False   False
4  False   True    False   False
5  False  False    False    True

In [4]:
data.isnull().sum()

EEID       0
Name       1
Gender     1
Salary     2
dtype: int64

In [12]:
data['salary']=data['Salary'].replace(np.nan,30000)
data

    EEID   Name  Gender    Salary   salary
0  EMP01  Arhaan       M      NaN  30000.0
1  EMP02   Dayam       M  25000.0  25000.0
2  EMP01    Anam     NaN  27000.0  27000.0
3  EMP04  Arhaan       M  20000.0  20000.0
4  EMP05     NaN       F  25000.0  25000.0
5  EMP06    Asif       M      NaN  30000.0